name: "LogReg"
layers {
  name: "mnist"
  type: HDF5_DATA
  top: "data_orig"
  top: "label"
  hdf5_data_param {
    source: "sample_data_list.txt"
    batch_size: 64
  }
  include: { phase: TRAIN }
}
layers {
  name: "mnist"
  type: HDF5_DATA
  top: "data_orig"
  top: "label3"
  hdf5_data_param {
    source: "sample_data_list-test.txt"
    batch_size: 64
  }
  include: { phase: TEST }
}

layers {
  name: "slice"
  type: SLICE
  bottom: "data_orig"
  top: "data"
  top: "data_output"
  slice_param {
	slice_dim: 1
	slice_point : 2
  }
}

#this part should be the same in learning and prediction network
layers {
  name: "conv1_7x7_64"
  type: CONVOLUTION
  bottom: "data"
  top: "conv2"
  convolution_param {
    num_output: 64
    kernel_size: 7
    pad: 3
    }
}

layers {
  name: "ip"
  type: INNER_PRODUCT
  bottom: "conv2"
  top: "ip"
  inner_product_param {
    num_output: 361
  }
}


#only learning framework
layers {
  name: "flat"
  type: FLATTEN
  bottom: "data_output"
  top: "flat"
}
layers {
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "ip"
  bottom: "flat"
  top: "loss"
}

