name: "LogReg"
input: "data"
input_dim: 1
input_dim: 2
input_dim: 19
input_dim: 19

layers {
  name: "ip"
  type: INNER_PRODUCT
  bottom: "data"
  top: "ip"
  inner_product_param {
    num_output: 500
  }
}
layers {
  name: "feat"
  type: SOFTMAX
  bottom: "ip"
  top: "feat"
}
